## Pandas Data Frame

In [59]:
import pandas as pd

### csv

In [60]:
data_csv = pd.read_csv("datasets/Iris_data_sample.csv", index_col = 0)
data_csv.head()

  SepalLengthCm  SepalWidthCm PetalLengthCm  PetalWidthCm      Species
1           5.1           3.5           1.4           0.2  Iris-setosa
2           4.9           NaN           1.4           0.2          NaN
3           4.7           3.2           1.3           0.2  Iris-setosa
4            ??           3.1           1.5           0.2  Iris-setosa
5             5           3.6           ###           0.2  Iris-setosa

remove special values with na_values

In [61]:
data_csv = pd.read_csv("datasets/Iris_data_sample.csv", index_col = 0, na_values = ["??","###"])
data_csv.head()

   SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
1            5.1           3.5            1.4           0.2  Iris-setosa
2            4.9           NaN            1.4           0.2          NaN
3            4.7           3.2            1.3           0.2  Iris-setosa
4            NaN           3.1            1.5           0.2  Iris-setosa
5            5.0           3.6            NaN           0.2  Iris-setosa

### excel

In [62]:
data_xlsx = pd.read_excel("datasets/Iris_data_sample.xlsx",sheet_name = 'Iris_data')
data_xlsx.head()

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,NaN,1.4,0.2,NaN
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,??,3.1,1.5,0.2,Iris-setosa
4,5,5,3.6,###,0.2,Iris-setosa

In [63]:
data_xlsx = pd.read_excel("datasets/Iris_data_sample.xlsx",sheet_name = 'Iris_data', na_values = ["??","###"])
data_xlsx.head()

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,NaN,1.4,0.2,NaN
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,NaN,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,NaN,0.2,Iris-setosa

### text

In [64]:
data_txt1 = pd.read_table("datasets/Iris_data_sample.txt")
data_txt1.head()

   "SepalLengthCm" "SepalWidthCm" "PetalLengthCm" "PetalWidthCm" "Species"
0                  1 1 5.1 3.5 1.4 0.2 "Iris-setosa"
1                    2 2 4.9 3 1.4 0.2 "Iris-setosa"
2                  3 3 4.7 3.2 1.3 0.2 "Iris-setosa"
3                  4 4 4.6 3.1 1.5 0.2 "Iris-setosa"
4                    5 5 5 3.6 1.4 0.2 "Iris-setosa"

In [65]:
data_txt1 = pd.read_table("datasets/Iris_data_sample.txt", delimiter = " ",na_values = ["??","###"])
data_txt1.head()

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
1,1,5.1,3.5,1.4,0.2,Iris-setosa
2,2,4.9,3.0,1.4,0.2,Iris-setosa
3,3,4.7,3.2,1.3,0.2,Iris-setosa
4,4,4.6,3.1,1.5,0.2,Iris-setosa
5,5,5.0,3.6,1.4,0.2,Iris-setosa

## Pandas Dataframes I

In [66]:
import pandas as pd
import numpy as np

In [67]:
cars_data = pd.read_csv("datasets/Toyota.csv", index_col = 0)
cars_data.head()

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel  90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel  90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel  90       0.0          0  2000      3    1170

### Shallow Copy

In [68]:
samp1 = cars_data.copy(deep = False) # affect original data

In [69]:
cars_data1 = cars_data.copy(deep = True) # does not affect original data

In [70]:
cars_data1.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
           dtype='int64', length=1436)

In [71]:
cars_data1.size

14360

In [72]:
cars_data1.shape

(1436, 10)

In [73]:
cars_data1.memory_usage()

Index        11488
Price        11488
Age          11488
KM           11488
FuelType     11488
HP           11488
MetColor     11488
Automatic    11488
CC           11488
Doors        11488
Weight       11488
dtype: int64

In [74]:
cars_data1.ndim

2

In [75]:
cars_data1.at[4,'FuelType']

'Diesel'

In [76]:
cars_data1.iat[5,6]

0

In [77]:
cars_data1.loc[:,'FuelType']

0       Diesel
1       Diesel
2       Diesel
3       Diesel
4       Diesel
         ...
1431    Petrol
1432    Petrol
1433    Petrol
1434       NaN
1435    Petrol
Name: FuelType, Length: 1436, dtype: object

## Pandas Dataframes II

In [78]:
cars_data1.dtypes

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

In [79]:
cars_data1.select_dtypes(exclude = [object]).head()

   Price   Age  MetColor  Automatic    CC  Weight
0  13500  23.0       1.0          0  2000    1165
1  13750  23.0       1.0          0  2000    1165
2  13950  24.0       NaN          0  2000    1165
3  14950  26.0       0.0          0  2000    1165
4  13750  30.0       0.0          0  2000    1170

In [80]:
cars_data1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 155.7+ KB

In [81]:
np.unique(cars_data1['KM'])

array(['1', '10000', '100123', ..., '99865', '99971', '??'], dtype=object)

## Pandas Dataframes III

In [82]:
cars_data = pd.read_csv("datasets/Toyota.csv", index_col = 0, na_values = ["??","????"])
cars_data.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,three,1165
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170

In [83]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(4), int64(4), object(2)
memory usage: 123.4+ KB

In [84]:
cars_data['MetColor'] = cars_data['MetColor'].astype('object')

cars_data['Automatic'] = cars_data['Automatic'].astype('object')

In [85]:
cars_data['FuelType'].nbytes

11488

In [86]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1430 non-null   float64
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(3), object(4)
memory usage: 123.4+ KB

#### Cleaning column 'Doors'

In [87]:
np.unique(cars_data['Doors'])

array(['2', '3', '4', '5', 'five', 'four', 'three'], dtype=object)

In [88]:
cars_data['Doors'].replace('three', 3,inplace = True)

cars_data['Doors'].replace('four', 4,inplace = True)

cars_data['Doors'].replace('five', 5,inplace = True)

In [89]:
cars_data['Doors'] = cars_data['Doors'].astype('int64')

In [90]:
cars_data.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             6
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

## Control structures & Functions

In [91]:
# create 3 bins from the ‘Price’ variable using If Else and For Loops
# The binned values will be stored as classes in a new column, ‘Price Class’ Hence, inserting a new column

cars_data.insert(10,"Price_Class","")

#### 1. For Loop

In [92]:
for i in range(0,len(cars_data['Price']),1):
    if (cars_data['Price'][i] <= 8450):
        cars_data['Price_Class'][i] = "Low"
    elif ((cars_data['Price'][i] > 11950)):
        cars_data['Price_Class'][i] = "High"
    else : cars_data['Price_Class'][i] = "Medium"
        
cars_data.head()

<ipython-input-92-c3c498773939>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cars_data['Price_Class'][i] = "High"
<ipython-input-92-c3c498773939>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cars_data['Price_Class'][i] = "Low"
<ipython-input-92-c3c498773939>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  else : cars_data['Price_Class'][i] = "Medium"

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_Class
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,3,1165,High
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High

In [93]:
cars_data['Price_Class'].value_counts()

Medium    751
Low       369
High      316
Name: Price_Class, dtype: int64

#### 2. While Loop

In [94]:
i = 0

while i < len(cars_data['Price']):
    if (cars_data['Price'][i] <= 8450):
        cars_data['Price_Class'][i] = "Low"
    elif ((cars_data['Price'][i] > 11950)):
        cars_data['Price_Class'][i] = "High"
    else : cars_data['Price_Class'][i] = "Medium"
    i =i+1
        
cars_data.head()

<ipython-input-94-f42aed23fc7a>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cars_data['Price_Class'][i] = "High"
<ipython-input-94-f42aed23fc7a>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cars_data['Price_Class'][i] = "Low"
<ipython-input-94-f42aed23fc7a>:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  else : cars_data['Price_Class'][i] = "Medium"

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_Class
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,3,1165,High
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High

## Functions in Python

- Converting the Age variable from months to years by defining a function
- The converted values will be stored in a new column, ‘Age_Converted’

In [95]:
cars_data.insert(11,"Age_Converted",0)

In [96]:
def c_convert(val):
    val_converted = val/12
    return val_converted

In [97]:
cars_data["Age_Converted"] = round(c_convert(cars_data["Age"]),2)
cars_data.head(2)

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_Class,Age_Converted
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,3,1165,High,1.92
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High,1.92

### Function with multiple inputs and outputs
- Converting the Age variable from months to years and getting kilometers (KM) run per month.
- The converted values of kilometer will be stored in a new column,‘km_per_month’

In [98]:
cars_data.insert(12,"Km_per_month",0)

In [99]:
def c_convert(val1,val2):
    val_converted = val1/12
    ratio = val2/val1
    return [val_converted,ratio]

In [100]:
# Age and KM columns of the data set are input to the function
# The outputs are assigned to ‘Age_Converted’ and ‘km_per_month’

cars_data["Age_Converted"],cars_data["Km_per_month"] = c_convert(cars_data["Age"],cars_data["KM"])

cars_data.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_Class,Age_Converted,Km_per_month
0,13500,23.0,46986.0,Diesel,90.0,1.0,0,2000,3,1165,High,1.916667,2042.869565
1,13750,23.0,72937.0,Diesel,90.0,1.0,0,2000,3,1165,High,1.916667,3171.173913
2,13950,24.0,41711.0,Diesel,90.0,NaN,0,2000,3,1165,High,2.000000,1737.958333
3,14950,26.0,48000.0,Diesel,90.0,0.0,0,2000,3,1165,High,2.166667,1846.153846
4,13750,30.0,38500.0,Diesel,90.0,0.0,0,2000,3,1170,High,2.500000,1283.333333